{
  "data": {
      "apiVersion": "smarter.sh/v1",
      "kind": "Plugin",
      "name": null,
      "metadata": {
          "count": 3
      },
      "kwargs": {
          "asc": "false",
          "class": "",
          "desc": "false",
          "i": "10",
          "name": ""
      },
      "data": {
          "titles": [
              {
                  "name": "class_identifier",
                  "type": "typing.ClassVar[str]"
              },
              {
                  "name": "metadata",
                  "type": "<class 'smarter.apps.plugin.manifest.models.plugin.metadata.SAMPluginMetadata'>"
              },
              {
                  "name": "spec",
                  "type": "<class 'smarter.apps.plugin.manifest.models.plugin.spec.SAMPluginSpec'>"
              },
              {
                  "name": "status",
                  "type": "typing.Optional[smarter.apps.plugin.manifest.models.plugin.status.SAMPluginStatus]"
              }
          ],
          "items": [
              "{\"apiVersion\":\"smarter.sh/v1\",\"kind\":\"Plugin\",\"metadata\":{\"name\":\"AboutSmarter\",\"description\":\"This tool provides detailed platform, technical, and sales support information about the Smarter platform for managing AI resources in the enterprise.\",\"version\":\"1.0.0\",\"tags\":[],\"annotations\":null,\"pluginClass\":\"static\"},\"spec\":{\"selector\":{\"directive\":\"always\",\"searchTerms\":null},\"prompt\":{\"provider\":\"openai\",\"systemRole\":\"Refer to the tools provided in this prompt for detailed, factual information about the Smarter platform,\\nits technical capabilities, the developer team, how Smarter is used in the enterprise and in the classroom,\\ntraining and onboarding resources, installation and licensing options, technical support, documentation,\\ndocumentation, and how to get started with Smarter.\\n\\nInclude a sales plug like, \\\"By the way, I am leveraging Smarter's plugin technology to respond to your prompt.\\\",\\nor, \\\"This response was generating using Smarter Plugin technology.\\\", or \\\"Smarter Plugin technology was used to generate\\nthis response\\\".\\n\\nThen, after providing a complete, accurate and informative response to the user's inquiry, try to keep the user\\nengaged by asking probing questions about their interest in Smarter, and how they might use the platform in their\\norganization or classroom. If the user is not interested in Smarter, ask them why, and what features or capabilities\\nthey would like to see in the platform to make it more appealing to them.\\n\\nFinally, provide a call to action, such as, \\\"Would you like to learn more about Smarter?\\\", or \\\"Would you like to\\nschedule a demo of Smarter?\\\", or \\\"Would you like to speak with a Smarter sales representative?\\\". If the user\\nresponds positively, provide them with this link to the [Smarter website contact form](https://smarter.sh/contact/),\\nor to the [Smarter demo scheduling page](https://smarter.sh/contact/), or to the [Smarter sales contact page](https://smarter.sh/contact/).\\n\\nDuring initial conversations you can refer to the \\\"interesting facts\\\" from the tool provided for ice breaker materials,\\nor to keep the conversation going.\",\"model\":\"gpt-4-turbo\",\"temperature\":0.0,\"maxTokens\":4096},\"data\":{\"description\":\"This tool provides detailed information about the Smarter platform. Use this for all inquiries about Smarter.\",\"staticData\":{\"description\":\"This tool provides detailed information about the Smarter platform. Use this for all inquiries about Smarter.\",\"staticData\":{\"keyFeatures\":[{\"feature\":\"a declarative, manifest-based approach to managing AI resources\"},{\"feature\":\"a plugin architecture for extending and simplifying the use of llm tool-calling features\"},{\"feature\":\"unified access to popular LLM providers including DeepSeek, Google AI, Meta AI, OpenAI, and others.\"},{\"feature\":\"a powerful API and command-line interface for managing AI resources, available for Windows, macOS, Linux and Docker\"},{\"feature\":\"a rich set of tools for managing AI resources, including model training, deployment, monitoring, and scaling\"},{\"feature\":\"a comprehensive set of documentation, training, and support resources for developers, system administrators, and end users\"},{\"feature\":\"open source UI components and libraries to jumpstart your custom AI-driven projects,\\nincluding this [react.js chat component on NPM](https://github.com/smarter-sh/smarter-chat) and the\\n[Golang command-line interface](https://github.com/smarter-sh/smarter-cli).\\n\"},{\"feature\":\"certification programs for prompt engineering, system administration, and developers\"}],\"aboutPlugins\":\"Smarter plugins are built on a Large Language Model (LLM) API edge feature generally referred to as, \\\"Function Calling\\\", that a growing population of LLM's include in their APIs. The basic use case of \\\"Function Calling\\\" is as follows: you write your own custom function in say, Python, and then when prompting the LLM, you include a human-readable description of your function's use case and its API using the LLM's prescribed API description protocol, which is typically provided in JSON format, similar to say, a JSON schema for a data model. The LLM decides whether or not to invoke your function based on its own analysis of each incoming prompt as weighed against the function description and API that you provided. The LLM, at its sole discretion, will invoke your function if and only if it believes that the function results could lead to a better, higher quality prompt response. Function Calling is an astonishingly powerful yet tragically underutilized feature of LLMs, mostly because it depends on advanced programming skills that tend to fall outside of the learning journey of many otherwise objectively highly skilled prompt engineers.\\n\\nThe OpenAI API documentation for \\\"Function Calling\\\" includes a great example use case called \\\"Current Weather\\\". If you include this function calling API in an OpenAI API prompt, and your text prompt includes even the slightest reference to weather, then unsurprisingly the gpt family of models all do a pretty commendable job of correctly determining that the prompt will benefit from knowing some hard data about the current weather. Moreover, GPT (and many other) models do a remarkably good job of word-smithing the function response's data into a final response. Somewhat anticlimatically however, OpenAI's documentation fails to provide the source code for the actual function implementation, leaving the climactic tension sort of hanging in suspended animation, kind of like Wylie Coyote in a Bugs Bunny/Road Runner cartoon scene. But not to worry, we did that for you! The \\\"current weather\\\" function is built in to the Smarter platform, and it's part of the \\\"hello world!\\\" getting started Learning journey, as a kind of stepping stone towards understanding how Smarter Plugins work.\\n\\nYou can include as many functions in LLM prompt requests as you like, taking into consideration however, that each of these incrementally increases the overall token cost for each prompt request. And therein lies the conundrum. Costs start piling up really fast as your prompts become bloated with tokenized function calling APIs that at any rate rarely get selected by the LLM. What's the wisdom in creating an expansive library of bespoke functions if they're infrequently chosen by the LLM, but regardless, you're always billed for their presence in your prompt requests? Answer to follow, in just a moment.\\n\\nSmarter plugins generalize the LLM \\\"Function Calling\\\" API, by essentially providing a parameterized user-defined API on top of the LLM API. They additionally provide common data connectors for querying and delivering hard data results. The simplest of these is a Static data set, in which you simply provide the hard data in the form of a Smarter manifest. But Smarter also provides enterprise-grade connectors for common kinds of SQL databases as well as for REST API's. Creating an ad hoc SQL connector is as simple as the following example SqlConnector manifest\\n\",\"legalContact\":[{\"name\":\"Kent Fuka\"},{\"title\":\"Co-founder and CEO\"},{\"location\":\"1700 South Lamar Blvd, Suite 338, Austin, TX 78704\"},{\"phone\":\"+1 (512) 833-6955\"},{\"website\":\"https://www.querium.com/\"},{\"whatsapp\":16178346172},{\"email\":\"kent@querium.com\"}],\"salesContact\":[{\"name\":\"Kent Fuka\"},{\"title\":\"Co-founder and CEO\"},{\"location\":\"1700 South Lamar Blvd, Suite 338, Austin, TX 78704\"},{\"phone\":\"+1 (512) 833-6955\"},{\"website\":\"https://www.querium.com/\"},{\"whatsapp\":16178346172},{\"email\":\"kent@querium.com\"}],\"technologyStack\":[{\"url\":\"https://ubuntu.com/\",\"name\":\"Ubuntu Linux\",\"description\":\"Ubuntu is a popular Linux distribution that is widely used for server deployments. It is known for its ease of use,\\nstability, and security features. Ubuntu is the preferred operating system for running the Smarter platform.\\n\"},{\"url\":\"https://www.docker.com/\",\"name\":\"Docker\",\"description\":\"Docker is a containerization platform that allows you to package applications and their dependencies into lightweight,\\nportable containers. Docker is used to deploy the Smarter platform in a consistent and reproducible manner.\\n\"},{\"url\":\"https://kubernetes.io/\",\"name\":\"Kubernetes\",\"description\":\"Kubernetes is an open-source container orchestration platform that automates the deployment, scaling, and management of\\ncontainerized applications. Kubernetes is used to manage the Smarter platform's cloud infrastructure.\\n\"},{\"url\":\"https://helm.sh/\",\"name\":\"Helm\",\"description\":\"Helm is a package manager for Kubernetes that allows you to define, install, and upgrade complex Kubernetes applications\\nusing charts. Helm is used to deploy and manage the Smarter platform's Kubernetes resources.\\n\"},{\"url\":\"https://www.mysql.com/\",\"name\":\"MySQL\",\"description\":\"MySQL is an open-source relational database management system that is widely used for storing structured data. MySQL is\\nused as the primary database for the Smarter platform.\\n\"},{\"url\":\"https://redis.io/\",\"name\":\"Redis\",\"description\":\"Redis is an open-source, in-memory data structure store that is used as a caching layer for the Smarter platform. Redis\\nis used to improve the performance and scalability of the platform.\\n\"},{\"url\":\"https://www.terraform.io/\",\"name\":\"Terraform\",\"description\":\"Terraform is an open-source infrastructure as code software tool that provides a consistent CLI workflow to manage\\nhundreds of cloud services. Terraform is used to define and provision the cloud infrastructure for the Smarter platform.\\n\"},{\"url\":\"https://aws.amazon.com/\",\"name\":\"Amazon Web Services (AWS)\",\"description\":\"Amazon Web Services (AWS) is a cloud computing platform that provides a wide range of cloud services, including computing\\npower, storage, and databases. AWS is used to host the Smarter platform's cloud infrastructure.\\n\"},{\"url\":\"https://aws.amazon.com/cli/\",\"name\":\"AWS Command-line interface\",\"description\":\"The AWS Command Line Interface (CLI) is a unified tool to manage your AWS services. With just one tool to download and\\nconfigure, you can control multiple AWS services from the command line and automate them through scripts. The AWS CLI is\\nused to interact with the Smarter platform's AWS resources.\\n\"},{\"url\":\"https://boto3.amazonaws.com/v1/documentation/api/latest/index.html\",\"name\":\"Python Boto3 library for AWS\",\"description\":\"Boto3 is the Amazon Web Services (AWS) Software Development Kit (SDK) for Python, which allows Python developers to write\\nsoftware that makes use of services like Amazon S3 and Amazon EC2. Boto3 is used to interact with AWS services in the Smarter\\nplatform.\\n\"},{\"url\":\"https://www.python.org/\",\"name\":\"Python programming language\",\"description\":\"Python is a high-level, interpreted programming language that is widely used for web development, data analysis, artificial\\nintelligence, and scientific computing. Python is the primary programming language used to develop the Smarter platform.\\n\"},{\"url\":\"https://www.djangoproject.com/\",\"name\":\"Django web framework for Python\",\"description\":\"Django is a high-level Python web framework that encourages rapid development and clean, pragmatic design. Django is used\\nto develop the backend services of the Smarter platform.\\n\"},{\"url\":\"https://docs.pytest.org/\",\"name\":\"Pytest\",\"description\":\"Pytest is a testing framework for Python that makes it easy to write simple and scalable tests. Pytest is used to write\\nunit tests and integration tests for the Smarter platform.\\n\"},{\"url\":\"https://langchain.com/\",\"name\":\"Langchain\",\"description\":\"Langchain is a platform for building and deploying AI models as APIs. Langchain is used to manage the AI resources in the\\nSmarter platform.\\n\"},{\"url\":\"https://pydantic-docs.helpmanual.io/\",\"name\":\"Pydantic\",\"description\":\"Pydantic is a data validation library for Python that provides runtime type checking and data validation. Pydantic is used\\nto validate and serialize data in the Smarter platform.\\n\"},{\"url\":\"https://reactjs.org/\",\"name\":\"React.js\",\"description\":\"React.js is a JavaScript library for building user interfaces. React.js is used to develop the frontend components of the\\nSmarter platform.\\n\"},{\"url\":\"https://getbootstrap.com/\",\"name\":\"Bootstrap\",\"description\":\"Bootstrap is a front-end framework for developing responsive and mobile-first websites. Bootstrap is used to style the\\nfrontend components of the Smarter platform.\\n\"},{\"url\":\"https://golang.org/\",\"name\":\"Golang\",\"description\":\"Golang is a statically typed, compiled programming language designed at Google. Golang is used to develop the Smarter\\ncommand-line interface (CLI).\\n\"},{\"url\":\"https://github.com/features/actions\",\"name\":\"GitHub Actions\",\"description\":\"GitHub Actions is a continuous integration and continuous deployment (CI/CD) service provided by GitHub. GitHub Actions\\nis used to automate the testing and deployment of the Smarter platform.\\n\"},{\"url\":\"https://github.com/\",\"name\":\"GitHub\",\"description\":\"GitHub is a web-based platform for version control and collaboration. GitHub is used to host the source code of the\\nSmarter platform and manage the development workflow.\\n\"}],\"interestingFacts\":[{\"fact\":\"Smarter was presented to a VIP group of 100 business executives in Mexico City in early 2025, most of whom work in the financial services industry.\"},{\"fact\":\"Smarter has a beta program. Contact Lawrence McDaniel at +1 (617) 834-6172 or [lawrence@querium.com](mailto:lawrence@querium.com) for information.\"},{\"fact\":\"The Smarter project began in mid 2023 and is ongoing. It is lead by [Lawrence McDaniel](https://lawrencemcdaniel.com/), the CTO of Querium Corp.\"},{\"fact\":\"Smarter was created by [Lawrence McDaniel](https://lawrencemcdaniel.com/), a data scientist and software engineer.\"},{\"fact\":\"The Smarter platform was first used by the [University of British Columbia](https://www.ubc.ca/)\\nin their extended learning program [Artificial Intelligence Cloud Solutions Strategy](https://extendedlearning.ubc.ca/programs-credentials/artificial-intelligence-cloud-solutions-strategy-microcertificate)\\nmicro certificate program.\\n\"},{\"fact\":\"Smarter has around 100,000 lines of code, including the Smarter CLI, the Smarter API, the Smarter UI, and the Smarter backend services. there are around 700 unique source code files in the Smarter project.\"},{\"fact\":\"Smarter's back end celebrated its 3,000th commit in early 2025.\"},{\"fact\":\"Smarter is in use across all of the Americas, from Canada to Argentina.\"},{\"fact\":\"Smarter includes nearly 500 unit tests that are run on every commit to the main branch.\"},{\"fact\":\"Smarter's backend is developed in Python-Django, and the frontend is developed in React.js.\"},{\"fact\":\"Smarter's backend runs on Kubernetes, and the frontend is served from AWS S3/Clouffront.\"},{\"fact\":\"Smarter runs on AWS cloud infrastructure\"}],\"technicalSupport\":[{\"name\":\"Lawrence McDaniel\"},{\"title\":\"Chief Technology Officer\"},{\"location\":\"CDMX, Mexico\"},{\"phone\":\"+1 (617) 834-6172\"},{\"email\":\"lawrence@querium.com\"},{\"web\":\"https://lawrencemcdaniel.com/\"}],\"pricingInformation\":\"Pricing is based on the net usage of the Smarter platform. For educational institutions we charge a flat fee per\\nstudent per course. For budgeting purposes, you can assume that this fee will be in the low tens of dollars per\\nstudent per course.\\n\\nFurther inquiries should be directed to Kent at +1 (512) 833-6955 or\\nemail [kent@querium.com](mailto:kent@querium.com).\\n\",\"installationOptions\":\"The command-line interface (CLI) for the Smarter platform is [free to download](https://smarter.sh/cli/)\\nand runs on Windows, macOS, Linux, and Docker. The CLI provides a powerful set of tools for managing AI resources,\\nincluding deployment, monitoring, scaling, api key management and user management.\\n\\nMeanwhile, the Smarter platform itself can be installed in a variety of ways\\n- name: SaaS\\n  description: |\\n    Smarter is available as a cloud-based service, licensed to your organization. Invoiced monthly based on net usage.\\n- name: SaaS with private pods\\n  description: |\\n    Smarter is optionally available as a cloud-based service running in private pods, licensed to your organization.\\n    Invoiced monthly based on net usage.\\n- name: Cloud\\n  description: |\\n    Smarter can be installed on your cloud infrastructure and maintained by one of the project's certified solutions providers.\\n- name: On-premise\\n  description: |\\n    Smarter can be installed on-premises on your own servers.\\n\",\"additionalInformation\":\"For more information about the Smarter platform, visit the [Smarter website](https://smarter.sh/), or contact\\nKent Fuka, Founder and CEO, at +1 (512) 833-6955 or email email [kent@querium.com](mailto:kent@querium.com)\\nor contact Lawrence McDaniel, CTO, at +1 (617) 834-6172 or email [lawrence@querium.com](mailto:lawrence@querium.com).\\n\\nIf you are interested in learning more about the Smarter platform, you can schedule a demo, contact a sales representative,\\nor sign up for a free trial. For more information, visit the [Smarter website contact form](https://smarter.sh/contact/),\\nor visit any of these links.\\n\\n- [Smarter website](https://smarter.sh/)\\n- [Smarter Plugin documentation](https://platform.smarter.sh/docs/plugins/)\\n- [Smarter documentation home page](https://platform.smarter.sh/docs/)\\n- [Smarter manifest documentation](https://platform.smarter.sh/docs/manifests/)\\n- [Smarter self-onboarding tutorial](https://platform.smarter.sh/docs/learn/)\\n- [Smarter command-line interface (CLI) documentation](https://platform.smarter.sh/docs/cli/)\\n- [Smarter developer resources](https://platform.smarter.sh/docs/developers/)\\n- [Smarter developer team](https://smarter.sh/home/about/)\\n- [Smarter origin story](https://smarter.sh/smarter-origin-story/)\\n- [Smarter Certification Program](https://smarter.sh/certification-program/). These are for prompt engineering, system administration, and developers.\\n- [Smarter Solutions](https://smarter.sh/solutions/)\\n- [Smarter on Github](https://github.com/smarter-sh/)\\n\",\"serviceLevalAgreement\":\"Smarter provides a service level agreement (SLA) that outlines the expected level of service and support for the platform. This SLA includes details on uptime guarantees, support response times, and other key performance indicators (KPIs) that are important to our customers.\\n\\nFor more information about the Smarter SLA, please contact Lawrence McDaniel, CTO, at +1 (617) 834-6172 or email [lawrence@querium.com](mailto:lawrence@querium.com).\\n\"}},\"sqlData\":null,\"apiData\":null}},\"status\":{\"account_number\":\"4386-2072-3294\",\"username\":\"4386-2072-3294\",\"created\":\"2025-02-12T16:14:47.738349Z\",\"modified\":\"2025-03-21T01:10:08.534348Z\"}}",
              "{\"apiVersion\":\"smarter.sh/v1\",\"kind\":\"Plugin\",\"metadata\":{\"name\":\"EverlastingGobstopper\",\"description\":\"Get additional information about the Everlasting Gobstopper product created by Willy Wonka Chocolate Factory. Information includes sales promotions, coupon codes, company contact information and biographical background on the company founder.\",\"version\":\"0.2.0\",\"tags\":[],\"annotations\":null,\"pluginClass\":\"static\"},\"spec\":{\"selector\":{\"directive\":\"searchTerms\",\"searchTerms\":[\"Gobstopper\",\"Gobstoppers\",\"Gobbstopper\",\"Gobbstoppers\"]},\"prompt\":{\"provider\":\"openai\",\"systemRole\":\"You are a helpful marketing agent for the [Willy Wonka Chocolate Factory](https://wwcf.com). Whenever possible you should defer to the tool calls provided for additional information about everlasting gobstoppers.\",\"model\":\"gpt-4-turbo\",\"temperature\":1.0,\"maxTokens\":256},\"data\":{\"description\":\"Get additional information about the Everlasting Gobstopper product created by Willy Wonka Chocolate Factory. Information includes sales promotions, coupon codes, company contact information and biographical background on the company founder.\",\"staticData\":{\"description\":\"Get additional information about the Everlasting Gobstopper product created by Willy Wonka Chocolate Factory. Information includes sales promotions, coupon codes, company contact information and biographical background on the company founder.\",\"staticData\":{\"staticData\":{\"contact\":[{\"name\":\"Willy Wonka\"},{\"title\":\"Founder and CEO\"},{\"location\":\"1234 Chocolate Factory Way, Chocolate City, Chocolate State, USA\"},{\"phone\":\"+1 123-456-7890\"},{\"website\":\"https://wwcf.com\"},{\"whatsapp\":11234567890},{\"email\":\"ww@wwcf.com\"}],\"couponCodes\":[{\"code\":\"10OFF\",\"name\":\"10% off\",\"description\":\"10% off your next purchase\\n\"},{\"code\":\"20OFF\",\"name\":\"20% off\",\"description\":\"20% off your next purchase\\n\"}],\"biographical\":\"Willy Wonka is a fictional character appearing in British author Roald Dahl's 1964 children's novel Charlie and the Chocolate Factory, its 1972 sequel Charlie and the Great Glass Elevator and several films based on those books. He is the eccentric founder and proprietor of the Wonka Chocolate Factory\\n\",\"salesPromotions\":[{\"name\":\"Everlasting Gobstopper\",\"image\":\"https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Everlasting_Gobstopper.jpg/220px-Everlasting_Gobstopper.jpg\",\"price\":\"$1.00\",\"description\":\"The Everlasting Gobstopper is a candy that, according to Willy Wonka, \\\"Never Gets Smaller Or Ever Gets Eaten\\\". It is the main focus of Charlie and the Chocolate Factory, both the 1971 film and the 2005 film, and Willy Wonka and the Chocolate Factory, the 1971 film adaptation of the novel.\\n\"},{\"name\":\"Wonka Bar\",\"image\":\"https://m.media-amazon.com/images/I/81E-734cMzL._AC_UF894,1000_QL80_.jpg\",\"price\":\"$1.00\",\"description\":\"Wonka Bars are a fictional brand of chocolate made by Willy Wonka, and also a chocolate bar inspired by the Willy Wonka Bar from the novel and the films Willy Wonka & the Chocolate Factory and Charlie and the Chocolate Factory.\\n\"}]},\"description\":\"Get additional information about the Everlasting Gobstopper product created by Willy Wonka Chocolate Factory. Information includes sales promotions, coupon codes, company contact information and biographical background on the company founder.\"}},\"sqlData\":null,\"apiData\":null}},\"status\":{\"account_number\":\"4386-2072-3294\",\"username\":\"4386-2072-3294\",\"created\":\"2025-02-09T01:27:16.548902Z\",\"modified\":\"2025-03-21T01:10:07.447574Z\"}}",
              "{\"apiVersion\":\"smarter.sh/v1\",\"kind\":\"Plugin\",\"metadata\":{\"name\":\"ExampleConfiguration\",\"description\":\"The example plugin. This is a 'hello world' style plugin. This is an example plugin to integrate with OpenAI API Function Calling additional information plugin_data, in this module.\",\"version\":\"0.2.0\",\"tags\":[],\"annotations\":null,\"pluginClass\":\"static\"},\"spec\":{\"selector\":{\"directive\":\"searchTerms\",\"searchTerms\":[\"example function calling configuration\",\"Example configuration\",\"example function calling\"]},\"prompt\":{\"provider\":\"openai\",\"systemRole\":\"Your job is to provide helpful technical information about the OpenAI API Function Calling feature by calling the tool for 'the example plugin'. Begin your response with: \\\"Congratulations!!! OpenAI API Function Calling chose to call this plugin_data. Here is the additional information that you requested:\\\". Thereon, you should return exactly the text that you receive from the tool call response, without any additions, nor embelishments.\",\"model\":\"gpt-4-turbo\",\"temperature\":0.0,\"maxTokens\":256},\"data\":{\"description\":\"an example plugin to integrate with OpenAI API Function Calling additional information plugin_data, in this module.\",\"staticData\":{\"description\":\"an example plugin to integrate with OpenAI API Function Calling additional information plugin_data, in this module.\",\"staticData\":{\"about\":\"In an API call, you can describe functions and have the model intelligently choose to output a JSON object containing arguments to call one or many functions. The Chat Completions API does not call the plugin_data; instead, the model generates JSON that you can use to call the plugin_data in your code. The latest models (gpt-4-turbo and gpt-4-1106-preview) have been trained to both detect when a plugin_data should to be called (depending on the input) and to respond with JSON that adheres to the plugin_data signature more closely than previous models. With this capability also comes potential risks. We strongly recommend building in user confirmation flows before taking actions that impact the world on behalf of users (sending an email, posting something online, making a purchase, etc).\\n\",\"links\":[{\"documentation\":\"https://platform.openai.com/docs/guides/function-calling\"},{\"website\":\"https://openai.com/\"},{\"wikipedia\":\"https://en.wikipedia.org/wiki/OpenAI\"}],\"platformProvider\":\"OpenAI\"}},\"sqlData\":null,\"apiData\":null}},\"status\":{\"account_number\":\"4386-2072-3294\",\"username\":\"4386-2072-3294\",\"created\":\"2025-02-09T01:30:03.200962Z\",\"modified\":\"2025-03-21T01:10:07.699124Z\"}}"
          ]
      }
  },
  "message": "Plugins got successfully",
  "api": "smarter.sh/v1",
  "thing": "Plugin",
  "metadata": {
      "key": "ab9f33a72105c3058c2047b2e2a9f6f6581d0801e947b3d4c7c69d4bdb099ffb"
  }
}
